In [2]:
import numpy as np
import pandas as pd

## DataFrame 생성하기
- 행과 열의 자료구조 (series의 집합)
- 파이썬계의 엑셀 -> 테이블 구조

- 딕셔너리로 데이터프레임 생성
- dataFameVar =pd.DataFrame({key1:[value1,value2...], ...})

In [3]:
df1 = pd.DataFrame({'a':[10,23,45],'b':[56,23,45],'c':[10,23,50]})
df1

    a   b   c
0  10  56  10
1  23  23  23
2  45  45  50

In [4]:
# 자료구조 확인하기
type(df1)

pandas.core.frame.DataFrame

In [5]:
# a 컬럼의 데이터형과 자료구조 확인
print(df1['a'].dtype, type(df1['a']))

int64 <class 'pandas.core.series.Series'>

In [6]:
# 전체 행수
len(df1)

3

In [7]:
# a컬럼만 추출하기
df1['a']

0    10
1    23
2    45
Name: a, dtype: int64

## DataFrame의 속성
- dataFrame.value : 값만 추출
- dataFrame.index : 인덱스만 추출
- dataFrame.columns : 컬럼명만 추출
- dataFrame.index.name : 인덱스 이름 지정
- dataFrame.columns.name : 컬럼 이름 지정

In [8]:
df2 = pd.DataFrame({
    "name":['Elise','Julia','Jhon','Charles','Chales'],
    "year":[2014,2015,2016,2017,2018],
    "points":[1.5,1.7,1.6,2.5,2.9]
})

In [9]:
df2.index.name = 'Student ID'
df2.columns.name = 'Student Info'
df2

Student Info     name  year  points
Student ID
0               Elise  2014     1.5
1               Julia  2015     1.7
2                Jhon  2016     1.6
3             Charles  2017     2.5
4              Chales  2018     2.9

In [ ]:
df2.index

In [ ]:
df2.columns

## 데이터프레임 <- 이중구조의 딕셔너리
- 딕셔너리 정의 {key1:{key2:values1}}
- 데이터프레임이름 = pd.DataFrame(딕셔너리이름)

In [11]:
# 이중 딕셔너리 정의
myDict = {'col1':{2015:10,2016:20},
          'col2':{2015:45,2016:55,2017:27}}
myDict

{'col1': {2015: 10, 2016: 20}, 'col2': {2015: 45, 2016: 55, 2017: 27}}

In [12]:
df3 = pd.DataFrame(myDict)
df3

      col1  col2
2015  10.0    45
2016  20.0    55
2017   NaN    27

In [13]:
# 컬럼명과 인덱스명 재정의
df3.columns=['col11','col22']
df3.index=[15,16,17]
df3

    col11  col22
15   10.0     45
16   20.0     55
17    NaN     27

## 데이터프레임의 정보 확인
- dataFrameVar.head() : 5개 추출
- dataFrameVar.head(number) : number 갯수 만큼 추출
- dataFrameVar.tail : 뒷부분 기준으로 5개 추출
- dataFrameVar.tail(number) : 뒷부분 기준으로 number갯수만큼 추출
- dataFrameVar.describe()
- dataFrameVar.info()
- dataFrameVar.shape

In [17]:
# 랜덤값을 이용해서 데이터프레임 생성하기
df4 = pd.DataFrame(np.random.randn(6,4))
df4

          0         1         2         3
0  0.176851  0.983262  0.556395  1.012549
1 -0.532852  0.779975  0.612796  1.353175
2 -0.489091  0.295479 -0.486707 -0.635091
3 -2.927357 -1.050991  0.658230 -1.244832
4  0.937934 -0.635305 -1.395138  1.774265
5 -0.323080  1.548703 -1.440579  1.392053

In [18]:
df4.shape

(6, 4)

In [19]:
# shift + Tab
df4.head()

          0         1         2         3
0  0.176851  0.983262  0.556395  1.012549
1 -0.532852  0.779975  0.612796  1.353175
2 -0.489091  0.295479 -0.486707 -0.635091
3 -2.927357 -1.050991  0.658230 -1.244832
4  0.937934 -0.635305 -1.395138  1.774265

In [21]:
df4.head(2)

          0         1         2         3
0  0.176851  0.983262  0.556395  1.012549
1 -0.532852  0.779975  0.612796  1.353175

In [22]:
df4.tail()

          0         1         2         3
1 -0.532852  0.779975  0.612796  1.353175
2 -0.489091  0.295479 -0.486707 -0.635091
3 -2.927357 -1.050991  0.658230 -1.244832
4  0.937934 -0.635305 -1.395138  1.774265
5 -0.323080  1.548703 -1.440579  1.392053

In [23]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
0    6 non-null float64
1    6 non-null float64
2    6 non-null float64
3    6 non-null float64
dtypes: float64(4)
memory usage: 272.0 bytes

In [24]:
# 총 갯수, 평균, 평균분산, 최소값, 분기값, 최대값
df4.describe()

              0         1         2         3
count  6.000000  6.000000  6.000000  6.000000
mean  -0.526266  0.320187 -0.249167  0.608686
std    1.299708  0.995392  1.000442  1.238718
min   -2.927357 -1.050991 -1.440579 -1.244832
25%   -0.521912 -0.402609 -1.168031 -0.223181
50%   -0.406086  0.537727  0.034844  1.182862
75%    0.051868  0.932440  0.598696  1.382334
max    0.937934  1.548703  0.658230  1.774265

In [25]:
df4.mean()

0   -0.526266
1    0.320187
2   -0.249167
3    0.608686
dtype: float64

In [26]:
df4

          0         1         2         3
0  0.176851  0.983262  0.556395  1.012549
1 -0.532852  0.779975  0.612796  1.353175
2 -0.489091  0.295479 -0.486707 -0.635091
3 -2.927357 -1.050991  0.658230 -1.244832
4  0.937934 -0.635305 -1.395138  1.774265
5 -0.323080  1.548703 -1.440579  1.392053

## DataFrame 복사
- DataFrame 데이터를 복사할때 (무슨기호인지 안보임 ㅠ)기호를 사용하면 데이터위치만 복사한다.
- 그러므로 원본데이터는 하나이다.
- 데이터 내용까지 복사하려면 copy()를 사용한다.

In [27]:
df4_2 = df4.copy()
df4_2

          0         1         2         3
0  0.176851  0.983262  0.556395  1.012549
1 -0.532852  0.779975  0.612796  1.353175
2 -0.489091  0.295479 -0.486707 -0.635091
3 -2.927357 -1.050991  0.658230 -1.244832
4  0.937934 -0.635305 -1.395138  1.774265
5 -0.323080  1.548703 -1.440579  1.392053

In [28]:
df4_2.iloc[0,0] = 10
df4_2

           0         1         2         3
0  10.000000  0.983262  0.556395  1.012549
1  -0.532852  0.779975  0.612796  1.353175
2  -0.489091  0.295479 -0.486707 -0.635091
3  -2.927357 -1.050991  0.658230 -1.244832
4   0.937934 -0.635305 -1.395138  1.774265
5  -0.323080  1.548703 -1.440579  1.392053

In [29]:
df4

          0         1         2         3
0  0.176851  0.983262  0.556395  1.012549
1 -0.532852  0.779975  0.612796  1.353175
2 -0.489091  0.295479 -0.486707 -0.635091
3 -2.927357 -1.050991  0.658230 -1.244832
4  0.937934 -0.635305 -1.395138  1.774265
5 -0.323080  1.548703 -1.440579  1.392053

## 열 필터링
- dataFrameVar.colName
- dataFrameVar.[colName]
- dataFrameVar[[colName1, colName2 ...]]

In [ ]:
df4

In [30]:
df4.columns = ['col1','col2','col3','col4']
df4

       col1      col2      col3      col4
0  0.176851  0.983262  0.556395  1.012549
1 -0.532852  0.779975  0.612796  1.353175
2 -0.489091  0.295479 -0.486707 -0.635091
3 -2.927357 -1.050991  0.658230 -1.244832
4  0.937934 -0.635305 -1.395138  1.774265
5 -0.323080  1.548703 -1.440579  1.392053

In [31]:
df4.col1

0    0.176851
1   -0.532852
2   -0.489091
3   -2.927357
4    0.937934
5   -0.323080
Name: col1, dtype: float64

In [32]:
df4['col1']

0    0.176851
1   -0.532852
2   -0.489091
3   -2.927357
4    0.937934
5   -0.323080
Name: col1, dtype: float64

In [33]:
# 한개의 컬럼을 추출할때는 Series로 보여준다.
type(df4['col1'])

pandas.core.series.Series

In [34]:
# 다중으로 컬럼을 추출시에는 [[...]] 를 사용한다.
df4[['col1','col3']]

       col1      col3
0  0.176851  0.556395
1 -0.532852  0.612796
2 -0.489091 -0.486707
3 -2.927357  0.658230
4  0.937934 -1.395138
5 -0.323080 -1.440579

In [35]:
# 다중으로 컬럼을 추출시에는 DataFrame으로 보여준다.
type(df4[['col1','col3']])

pandas.core.frame.DataFrame

In [36]:
# 컬럼을 인덱스로 접근할 수는 없다.
# df4[0], df4[:, 0:2]
df4[:2]

       col1      col2      col3      col4
0  0.176851  0.983262  0.556395  1.012549
1 -0.532852  0.779975  0.612796  1.353175

In [38]:
data =({"name":['Elise','Julia','Jhon','Charles','Chales'],
        "year":[2014,2015,2016,2017,2018],
        "points":[1.5,1.7,1.6,2.5,2.9]})

# 데이타프레임 재정의
df = pd.DataFrame(data,
                  columns = ["year","name","points"],
                  index = ["one","two","three","four","five"])
df

       year     name  points
one    2014    Elise     1.5
two    2015    Julia     1.7
three  2016     Jhon     1.6
four   2017  Charles     2.5
five   2018   Chales     2.9

## 새로운 컬럼 추가하기
- dataFrameVar[newColumn] = value

In [39]:
# 동일한 값 입력
df['penalty']=0.5
df

       year     name  points  penalty
one    2014    Elise     1.5      0.5
two    2015    Julia     1.7      0.5
three  2016     Jhon     1.6      0.5
four   2017  Charles     2.5      0.5
five   2018   Chales     2.9      0.5

In [40]:
# 리스트로 새로운 컬럼값 구성
df['penalty2']=[12,20,30,45,55]
df

       year     name  points  penalty  penalty2
one    2014    Elise     1.5      0.5        12
two    2015    Julia     1.7      0.5        20
three  2016     Jhon     1.6      0.5        30
four   2017  Charles     2.5      0.5        45
five   2018   Chales     2.9      0.5        55

In [ ]:
# 리스트로 새로운 컬럼값 구성 - 에러발생
# ValueError : Lenghth of values dose not match Length
# df['penalty3'] = [12,20]

In [41]:
# 넘파이배열을 컬럼의 값으로 이용
df['id'] = np.arange(1,6)
df

       year     name  points  penalty  penalty2  id
one    2014    Elise     1.5      0.5        12   1
two    2015    Julia     1.7      0.5        20   2
three  2016     Jhon     1.6      0.5        30   3
four   2017  Charles     2.5      0.5        45   4
five   2018   Chales     2.9      0.5        55   5

In [42]:
# 넘파이 랜덤 배열을 새로운 컬럼의 값으로 이용
df['random']=np.random.randn(5)
df

       year     name  points  penalty  penalty2  id    random
one    2014    Elise     1.5      0.5        12   1  3.092621
two    2015    Julia     1.7      0.5        20   2  0.128097
three  2016     Jhon     1.6      0.5        30   3 -0.021549
four   2017  Charles     2.5      0.5        45   4 -0.681242
five   2018   Chales     2.9      0.5        55   5  0.063547

## 시리즈를 이용해서 새로운 컬럼값 구성

In [43]:
# 시리즈 생성
age_data = pd.Series([22,25,22], index=['one','two','three'])
age_data

one      22
two      25
three    22
dtype: int64

In [44]:
# 시리즈를 새 컬럼값으로 대입
# 같은 인덱스에 해당하는 값으로 삽임된다.
df['age'] = age_data
df

       year     name  points  penalty  penalty2  id    random   age
one    2014    Elise     1.5      0.5        12   1  3.092621  22.0
two    2015    Julia     1.7      0.5        20   2  0.128097  25.0
three  2016     Jhon     1.6      0.5        30   3 -0.021549  22.0
four   2017  Charles     2.5      0.5        45   4 -0.681242   NaN
five   2018   Chales     2.9      0.5        55   5  0.063547   NaN

## 기존 컬럼을 이용한 새로운 컬럼 생성

In [45]:
df['points2'] = df['points']*10
df

       year     name  points  penalty  penalty2  id    random   age  points2
one    2014    Elise     1.5      0.5        12   1  3.092621  22.0     15.0
two    2015    Julia     1.7      0.5        20   2  0.128097  25.0     17.0
three  2016     Jhon     1.6      0.5        30   3 -0.021549  22.0     16.0
four   2017  Charles     2.5      0.5        45   4 -0.681242   NaN     25.0
five   2018   Chales     2.9      0.5        55   5  0.063547   NaN     29.0

In [47]:
# 컬럼값에 조건식 이용하기
df['pass'] = df['points'] > 2.0
df

,year,name,points,penalty,penalty2,id,random,age,points2,pass
one,2014,Elise,1.5,0.5,12,1,3.092621,22.0,15.0,False
two,2015,Julia,1.7,0.5,20,2,0.128097,25.0,17.0,False
three,2016,Jhon,1.6,0.5,30,3,-0.021549,22.0,16.0,False
four,2017,Charles,2.5,0.5,45,4,-0.681242,NaN,25.0,True
five,2018,Chales,2.9,0.5,55,5,0.063547,NaN,29.0,True

## 다중행 추출

In [48]:
# 1행만 추출
df['one':'one']

,year,name,points,penalty,penalty2,id,random,age,points2,pass
one,2014,Elise,1.5,0.5,12,1,3.092621,22.0,15.0,False

In [49]:
# 1~3행 추출 -- 문자열은 문자열까지 포함해서 추출
df['one':'three']

,year,name,points,penalty,penalty2,id,random,age,points2,pass
one,2014,Elise,1.5,0.5,12,1,3.092621,22.0,15.0,False
two,2015,Julia,1.7,0.5,20,2,0.128097,25.0,17.0,False
three,2016,Jhon,1.6,0.5,30,3,-0.021549,22.0,16.0,False

In [50]:
# 숫자 인덱스 -- 마지막숫자 -1까지 추출
df[0:2]

,year,name,points,penalty,penalty2,id,random,age,points2,pass
one,2014,Elise,1.5,0.5,12,1,3.092621,22.0,15.0,False
two,2015,Julia,1.7,0.5,20,2,0.128097,25.0,17.0,False

## 컬럼추출

In [51]:
df.year

one      2014
two      2015
three    2016
four     2017
five     2018
Name: year, dtype: int64

In [52]:
df['year']

one      2014
two      2015
three    2016
four     2017
five     2018
Name: year, dtype: int64

In [53]:
df[['year','name']]

       year     name
one    2014    Elise
two    2015    Julia
three  2016     Jhon
four   2017  Charles
five   2018   Chales

## Dataframe : 행추출.loc 이용
- 데이타프레임이름.loc[start:end]
- 인덱스는 인덱스행이름만으로만 가능

In [54]:
df

,year,name,points,penalty,penalty2,id,random,age,points2,pass
one,2014,Elise,1.5,0.5,12,1,3.092621,22.0,15.0,False
two,2015,Julia,1.7,0.5,20,2,0.128097,25.0,17.0,False
three,2016,Jhon,1.6,0.5,30,3,-0.021549,22.0,16.0,False
four,2017,Charles,2.5,0.5,45,4,-0.681242,NaN,25.0,True
five,2018,Chales,2.9,0.5,55,5,0.063547,NaN,29.0,True

In [56]:
df.loc['three':'four']

,year,name,points,penalty,penalty2,id,random,age,points2,pass
three,2016,Jhon,1.6,0.5,30,3,-0.021549,22.0,16.0,False
four,2017,Charles,2.5,0.5,45,4,-0.681242,NaN,25.0,True

## Dataframe: 컬럼 추출.loc 이용
- dataFrameVar.loc[:, colName]
- dataFrameVar.loc[:, colName1:colName2]

In [57]:
# 한개의 컬럼만 추출
df.loc[:,'name']

one        Elise
two        Julia
three       Jhon
four     Charles
five      Chales
Name: name, dtype: object

In [58]:
# 다중 컬럼 추출
df.loc[:,'name':'points']

          name  points
one      Elise     1.5
two      Julia     1.7
three     Jhon     1.6
four   Charles     2.5
five    Chales     2.9

In [59]:
df.loc['three':'four','name':'penalty']

          name  points  penalty
three     Jhon     1.6      0.5
four   Charles     2.5      0.5

## 행과 열 추출 -iloc이용

In [62]:
# 1행 추출
df.iloc[:1]

,year,name,points,penalty,penalty2,id,random,age,points2,pass
one,2014,Elise,1.5,0.5,12,1,3.092621,22.0,15.0,False

In [63]:
# 1~3행 추출
df.iloc[0:3]

,year,name,points,penalty,penalty2,id,random,age,points2,pass
one,2014,Elise,1.5,0.5,12,1,3.092621,22.0,15.0,False
two,2015,Julia,1.7,0.5,20,2,0.128097,25.0,17.0,False
three,2016,Jhon,1.6,0.5,30,3,-0.021549,22.0,16.0,False

In [64]:
# 3~5열 추출
df.iloc[:, 2:5]

       points  penalty  penalty2
one       1.5      0.5        12
two       1.7      0.5        20
three     1.6      0.5        30
four      2.5      0.5        45
five      2.9      0.5        55

In [65]:
df.iloc[0:2,0:3]

     year   name  points
one  2014  Elise     1.5
two  2015  Julia     1.7

## loc이용하여 행추가

In [68]:
df

,year,name,points,penalty,penalty2,id,random,age,points2,pass
one,2014.0,Elise,1.5,0.5,12.0,1.0,3.092621,22.0,15.0,False
two,2015.0,Julia,1.7,0.5,20.0,2.0,0.128097,25.0,17.0,False
three,2016.0,Jhon,1.6,0.5,30.0,3.0,-0.021549,22.0,16.0,False
four,2017.0,Charles,2.5,0.5,45.0,4.0,-0.681242,NaN,25.0,True
five,2018.0,Chales,2.9,0.5,55.0,5.0,0.063547,NaN,29.0,True
six,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [67]:
df.loc['six',:]=[2019, 'Hidi', 4.5,2.0,33,6,33,33]
df

ValueError: Must have equal len keys and value when setting with an iterable

## Datafram: loc이용. 열추가
- 데이터프레임이름.loc[:,열인덱스명]=[값1,값2...]

In [69]:
df.loc[:,'pass2'] = False
df

,year,name,points,penalty,penalty2,id,random,age,points2,pass,pass2
one,2014.0,Elise,1.5,0.5,12.0,1.0,3.092621,22.0,15.0,False,False
two,2015.0,Julia,1.7,0.5,20.0,2.0,0.128097,25.0,17.0,False,False
three,2016.0,Jhon,1.6,0.5,30.0,3.0,-0.021549,22.0,16.0,False,False
four,2017.0,Charles,2.5,0.5,45.0,4.0,-0.681242,NaN,25.0,True,False
five,2018.0,Chales,2.9,0.5,55.0,5.0,0.063547,NaN,29.0,True,False
six,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,False

## Boolean Index
- 조건에 맞으면 결과값이 True/False 형태의 Boolean으로 표시
- dataFrame[BooleanIndex조건식]

In [71]:
data =  {"year":[2014,2015,2016,2015,2017,2013],
         "name":['Haidi','Haidi','Haidi','Charles','Charles','Hayoung'],
         "points":[1.5,1.7,3.6,2.5,2.9,4.0],
         "penalty":[0.1,0.2,0.3,0.4,0.5,0.1],
         "net_points":[1.4,1.5,3.3,2.1,2.4,2.1],
         "bonus":[10,20,30,40,50,60]}
        index=["one","two","three","four","five","six"])
df2

SyntaxError: invalid syntax (<ipython-input-71-ac02f64f00bd>, line 7)

In [ ]:
# | or , & and

In [ ]:
# name 컬럼값이 'Charles'이거나 'Haidi' 인 행 추출
df2[(df2['name']=='Charles')|(df2['name']=='Haidi')]

## 퀴즈
- df2 데이터프레임에서 bonus데이터값이 30~50 사이의 행을 추출하여라
- Boolean Index 이용

In [ ]:
## net_points 컬럼값이 2보다 작다면 0으로 대체
df2.loc[df2['net_points']<2, 'net_points'] = 0
df2

In [72]:
# 1행은 모두 결측값으로 대입
df3.loc[0,:] = np.nan
df3

    col11  col22
15   10.0   45.0
16   20.0   55.0
17    NaN   27.0
0     NaN    NaN

In [73]:
# 특정 인덱스에 결측값 삽입하기
df3.loc[1,0] = np.nan
df3.loc[3,3] = np.nan
df3

    col11  col22   0   3
15   10.0   45.0 NaN NaN
16   20.0   55.0 NaN NaN
17    NaN   27.0 NaN NaN
0     NaN    NaN NaN NaN
1     NaN    NaN NaN NaN
3     NaN    NaN NaN NaN

## dropna()로 결측값이 들어있는 행 삭제하기
- 데이터프레임이름.dropna(how="all") : NaN 값이 모두 들어있는 행 삭제하기
- 데이터프레임이름.dropna(how="any") : NaN 값이 하나라도 들어있는 행 삭제하기
- 실제적으로 삭제 명령이 적용되지 않으므로 기존 데이타프레임에 다시 대입한다.
- 데이타프레임이름 = 데이타프레임이름.dropna(how="any/all")

In [74]:
df3

    col11  col22   0   3
15   10.0   45.0 NaN NaN
16   20.0   55.0 NaN NaN
17    NaN   27.0 NaN NaN
0     NaN    NaN NaN NaN
1     NaN    NaN NaN NaN
3     NaN    NaN NaN NaN

In [75]:
df3.dropna(how='any')

Empty DataFrame
Columns: [col11, col22, 0, 3]
Index: []

In [76]:
df3

    col11  col22   0   3
15   10.0   45.0 NaN NaN
16   20.0   55.0 NaN NaN
17    NaN   27.0 NaN NaN
0     NaN    NaN NaN NaN
1     NaN    NaN NaN NaN
3     NaN    NaN NaN NaN

In [78]:
df3 = df3.dropna(how='all')
df3

    col11  col22   0   3
15   10.0   45.0 NaN NaN
16   20.0   55.0 NaN NaN
17    NaN   27.0 NaN NaN

## fillna()를 이용하여 결측값에 특정값 삽입하기
- dataFrameVar.fillna(value=값)
- 실제적으로 교체 명령이 적용되지 않으므로 기존 데이타 프레임에 다시 대입한다.
- 데이타프레임이름 = 데이타프레임이름.fillna(value=값)

In [79]:
# NaN값 0으로 변경
df4 = df4.fillna(value=0)

In [80]:
df4

       col1      col2      col3      col4
0  0.176851  0.983262  0.556395  1.012549
1 -0.532852  0.779975  0.612796  1.353175
2 -0.489091  0.295479 -0.486707 -0.635091
3 -2.927357 -1.050991  0.658230 -1.244832
4  0.937934 -0.635305 -1.395138  1.774265
5 -0.323080  1.548703 -1.440579  1.392053

## isnull()
- dataFrameVar.isnull()
- NaN 값에 True

In [ ]:
# 여러개의 행 삭제
df6 = df6.drop([1,4])
df6

In [ ]:
# 결측값을 빼고 합 구하기
df8.sum(skipna=True)

## 퀴즈
```
아래와 같은 데이타 프레임을 생성한 후
np.NaN 값을 각 열의 평균값으로 대체하여라
```

In [81]:
data = [[1.4, np.nan, 3.3, np.nan], 
        [7.1,-4.5,2.4,1.5],
        [np.nan,np.nan,0.75,-1.3],
        [0.75, -1.3, np.nan, 5.5]]

# 컬럼명과 행 인덱스 명 지정
df9 = pd.DataFrame(data, 
                   columns=["one","two","three","four"],
                   index=["a","b","c","d"])
df9

    one  two  three  four
a  1.40  NaN   3.30   NaN
b  7.10 -4.5   2.40   1.5
c   NaN  NaN   0.75  -1.3
d  0.75 -1.3    NaN   5.5